coil-pisoFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inlet
    {
        type            patch;
        nFaces          1805;
        startFace       2148995;
    }
    outlet
    {
        type            patch;
        nFaces          1805;
        startFace       2150800;
    }
    wall1
    {
        type            wall;
        inGroups        1(wall);
        nFaces          30400;
        startFace       2152605;
    }
)

// ************************************************************************* //
